alert('Завдання 3. В програмі зберігається масив з електронними поштами клієнтів. В діалогове вікно вводиться адреса електронної пошти. Вивести у відповідь “така електронна адреса вже зареєстрована!”, якщо вона вже є в цьому масиві, в іншому випадку - додати її до масиву. Продовжити введення до тих пір, поки не буде натиснута кнопка Отмена. Після цього вивести через кому всі адреси електронних пошт  у діалогове вікно.');

let arr = ['vyshnevsky.dmytro@kmrf.kiev.ua', 
'magarovskij.dmitro@kmrf.kiev.ua',
'bugaychuk.dmytro@kmrf.kiev.ua'];
let txt = 'Tака електронна адреса вже зареєстрована!';
let str, flag = true;
//Регулярний вираз
let regexp = /^\w+([\.-]?\w+)*@\w+([\.-]?\w+)*(\.\w{2,3})+$/;

while(1)
{
    str = prompt('Введіть електрону адресу:');
    if(str !== null)
    {
        if(regexp.test(str))
        {
            for(i of arr)
            {
                if(str == i)
                {
                    flag = false;
                    break;
                }
            }
            if(flag)
            {
                arr.push(str);
            }
            else
            {
                alert(txt);
            }
        }
        else
        {
            alert('Коректно введіть електрону адресу!');
        }
    }
    else
    {
        break;
    }
}

document.write(arr.join(', '));