function converterArea(){
    let x, a, g, k;
    alert('Вітаємо. Дана програма розроблена для конвертації площі з метрів квадратних у акри, гектари, та кілометри квадратні.');
    x = prompt('Введіть площу у метрах квадратних:', 21);
    x = Number(x);
    if(x > -1){
        console.log(`Вхідні дані: ${x} м^2`);
        a = x * 0.00024710538146717;
        g = x * 0.0001;
        k = x * 0.000001;
        console.log(`${x} м^2 = ${a} а = ${g} га = ${k} км^2`);
        alert(`${x} м^2 = ${a} а = ${g} га = ${k} км^2`);
    }
    else{
        alert('Ви ввели некоректне значення!');
    }
}
function culculateTheCostOfElecricity(){
    let x, y;
    alert('Вітаємо. Дана програма розроблена для розрахунку вартості електроенергії.')
    x = prompt('Введіть дані у кВт/год:', 121);
    console.log(`Вхідні дані: ${x} кВт/год`);
    x = Number(x);
    if(x <= 100 && x > 0){
        y = x * 0.9;
        console.log(`Вихідні дані: ${y} грн.`);
        alert(`За ${x} кВт/год ви маєте сплатити: ${y} грн.`);
    }
    else if(x > 0){
        y = 100 * 0.9 + (x - 100) * 1.68;
        console.log(`Вихідні дані: ${y} грн.`);
        alert(`За ${x} кВт/год ви маєте сплатити: ${y} грн.`);
    }
    else{
        alert('Ви ввели некоректне значення!');
    }
}